[
   {
     "id": "1",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/riding%20cities.webp",
     "alt": "Image vitrine du projet riding cities",
     "title": "Riding Cities",
     "description": "Vous êtes stagiaire développeur junior chez Webonzaï. Votre mission est de mettre à jour la page de Riding Cities, une association de skate, en ajoutant une section sur les membres fondateurs et en modifiant la section des plannings de cours pour inclure deux boutons (enfants/adultes). Le code HTML est à adapter, et le CSS est déjà prêt.",
     "link": "https://github.com/klombar/Projet-Riding-Cities",
     "difficultyRating": "1/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Riding%20cities/ridingCities1.png",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Riding%20cities/ridingCities2.png",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Riding%20cities/ridingCities3.png"
     },
     "introduction" : "Ce projet est une introduction aux fondamentaux du langage HTML, réalisé dans le cadre de la mise à jour de la page web d'une association. La tâche principale consistait à créer une nouvelle section sur la page en suivant les maquettes fournies. Dans cette section, j'ai ajouté un titre et deux boutons pour le téléchargement de plannings, tout en intégrant et en adaptant les styles CSS existants. Ce travail m'a permis de me familiariser avec l'ajout et la structuration d'éléments HTML, ainsi qu'avec l'interaction entre HTML et CSS pour la création de pages web. Pour ce projet, j'ai utilisé Figma pour consulter les maquettes et Visual Studio Code comme environnement de développement, deux outils essentiels pour tout développeur front-end."
   },
   {
     "id": "2",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/booki%20(1).webp",
     "alt": "Image vitrine du projet booki",
     "title": "Booki",
     "description": "Vous commencez votre alternance chez Booki en tant que développeur web. Votre mission est d’intégrer l’interface du site avec HTML et CSS, en vous basant sur la maquette fournie par Loïc, l’UI designer, et les instructions de Sarah, la CTO. Vous devez compléter la base de code et respecter les spécifications techniques pour créer le site.",
     "link": "https://github.com/klombar/Projet-Booki",
     "difficultyRating": "2/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Booki/booki1.png",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Booki/booki2.png",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Booki/booki3.png"
     },
     "introduction" : "Dans ce projet, j'ai créé la page d'accueil d'une agence de voyage en utilisant HTML et CSS. Mon objectif principal était d'intégrer l'interface responsive du site en me basant sur des maquettes Figma pour mobile, tablette et desktop.J'ai dû recréer l'aspect et le design fournis dans les maquettes tout en utilisant HTML pour la structure et CSS pour le style. Cette tâche m'a permis de développer des compétences dans la création de composants d'interface avec HTML et CSS, en veillant à ce que le rendu soit conforme aux maquettes tout en étant adapté à toutes les tailles d'écran.Ce projet m'a permis d'approfondir ma compréhension de la manière dont HTML et CSS fonctionnent ensemble pour créer des expériences utilisateur optimales sur différents appareils.En travaillant sur ce projet, j'ai acquis des compétences clés en design responsive, un domaine essentiel du développement web moderne. J'ai également appris à intégrer des maquettes de manière précise et à configurer un environnement de développement front-end efficace, des compétences indispensables pour évoluer en tant que développeur front-end."
   },
   {
     "id": "3",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/ohmyfood.webp",
     "alt": "Image vitrine du projet ohmyfood",
     "title": "Oh my food",
     "description": "Vous rejoignez Ohmyfood en tant que développeur junior pour développer un site \"mobile first\" répertoriant les menus de restaurants gastronomiques. Les clients pourront composer leur repas à l’avance pour éviter les temps d'attente. Vous devez intégrer les maquettes mobile et desktop fournies par l'UX designer et respecter les spécifications du brief créatif. Le site doit être responsive, et vous utiliserez SASS pour organiser le CSS et intégrer des animations.",
     "link": "https://github.com/klombar/Projet-OhMyFood-Openclassrooms",
     "difficultyRating": "2/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Ohmyfood/ohmyfood1.png",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Ohmyfood/ohmyfood2.png",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Ohmyfood/ohmyfood3.png",
      "img4" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Ohmyfood/ohmyfood4.png"
     },
     "introduction" : "Dans ce projet, j'ai intégré les maquettes fournies (mobile et desktop) et un prototype Figma, en me concentrant sur une approche mobile-first. Cela m'a permis de comprendre l'importance de créer des sites web réactifs et adaptatifs.J'ai ajouté des animations CSS pour rendre l'interface plus dynamique et améliorer l'expérience utilisateur.J'ai utilisé Sass pour optimiser et structurer le CSS, facilitant ainsi la maintenance du code. Enfin, j'ai versionné le projet avec Git et GitHub, ce qui m'a permis de suivre l'évolution du projet et de collaborer efficacement."
   },
   {
     "id": "4",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/print%20it.webp",
     "alt": "Image vitrine du projet print it",
     "title": "Print it",
     "description": "En tant que développeur front-end freelance, vous êtes chargé de dynamiser le site d'une imprimerie familiale, Print it. Votre première mission consiste à créer un carrousel pour le site, en suivant les instructions détaillées fournies par Lucien, le directeur.",
     "link": "https://github.com/klombar/Projet-Print_it-OpenClassRooms",
     "difficultyRating": "1/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Print%20it/printit1.png"
     },
      "introduction" : "Dans ce projet, j'ai appris à dynamiser un site d'imprimerie statique en y ajoutant un carrousel interactif avec JavaScript.Ma tâche principale consistait à mettre à jour le code HTML existant et à intégrer le carrousel en JavaScript, ce qui m'a permis de comprendre l'interaction entre JavaScript, HTML et CSS pour créer des éléments interactifs.J'ai utilisé Visual Studio Code pour coder et GitHub pour versionner le projet, ce qui m'a offert une expérience concrète de la programmation JavaScript dans un environnement de développement réel."
   },
   {
     "id": "5",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/Sophie%20Bluel.webp",
     "alt": "Image vitrine du projet sophie bluel",
     "title": "Sophie Bluel",
     "description": "En tant que développeur front-end pour l’agence ArchiWebos, vous rejoignez une équipe en renfort pour concevoir le site portfolio d'une architecte d’intérieur. Votre mission consiste à développer la page de présentation des travaux, la page de connexion administrateur et une modale pour uploader des médias. Vous travaillez avec le design Figma, le code back-end et le code front-end existants, tout en suivant les tâches définies dans le Kanban.",
     "link": "https://github.com/klombar/Projet-ArchiWebos-Sophie-Bluel",
     "difficultyRating": "4/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel1.png",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel2.png",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel3.png",
      "img4" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel4.png",
      "img5" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel5.png",
      "img6" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Sophie%20Bluel/sophiebluel6.png"
     },
     "introduction" : "Dans ce projet, j'ai créé une page web dynamique pour le site d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API.Ma tâche principale consistait à développer la page de présentation des travaux de l'architecte à partir du HTML fourni, en gérant les événements utilisateurs et en manipulant les éléments du DOM avec JavaScript.J'ai également créé une page de connexion pour l'administrateur du site, ainsi qu'une modale permettant d'uploader de nouveaux médias.Pour la première fois, j'ai travaillé avec un code back-end, ce qui m'a permis d'apprendre à communiquer avec une API. J'ai utilisé Figma pour consulter les maquettes, Visual Studio Code pour le développement et GitHub pour la gestion de version du projet."
   },
   {
     "id": "6",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/Kasa.webp",
     "alt": "Image vitrine du projet kasa",
     "title": "Kasa",
     "description": "En tant que développeur front-end freelance pour Kasa, vous devez refondre le site en React, en intégrant des composants et des routes React Router. Vous suivez les maquettes Figma responsives et implémentez des fonctionnalités comme une galerie d'images interactive et des menus déroulants animés. Le back-end n'est pas encore disponible, donc vous travaillez avec un fichier JSON contenant les 20 dernières annonces.",
     "link": "https://github.com/klombar/Projet-Kasa",
     "difficultyRating": "4/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Kasa/kasa1.png",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Kasa/kasa2.png",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Kasa/kasa3.png",
      "img4" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Kasa/kasa4.png"
     },
     "introduction" : "Dans ce projet, j'ai implémenté le front-end d'une application de location immobilière en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive.J'ai travaillé sur la logique de présentation des données et sur les composants React, ce qui m'a permis de mieux comprendre l'usage de cette bibliothèque JavaScript populaire pour la création d'interfaces utilisateur.J'ai utilisé React Router pour gérer la navigation entre les différentes pages de l'application, ce qui m'a appris à configurer efficacement le routage dans une application web moderne.Le projet s'est concentré exclusivement sur le développement front-end, en se basant sur les maquettes fournies et en utilisant des données simulées extraites d'un fichier JSON.Pour démarrer, j'ai utilisé Vite, un outil qui facilite la configuration initiale d'une application React. J'ai également utilisé Node.js pour exécuter du code JavaScript en dehors du navigateur."
   },
   {
     "id": "7",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/Nina%20Carducci%20Photographie.webp",
     "alt": "Image vitrine du projet nina carducci",
     "title": "Nina Carducci",
     "description": "En tant que développeur freelance, vous proposez vos services d'optimisation SEO à Nina Carducci, une photographe, pour améliorer la vitesse et la visibilité de son site. Vous lui proposez de corriger les problèmes d'images lourdes et d'optimiser le code du site. En retour, vous livrerez un rapport détaillant les améliorations et les résultats obtenus grâce à des audits de performance et d'accessibilité.",
     "link": "https://github.com/klombar/Projet-Nina-Carducci",
     "difficultyRating": "3/5",
     "projectDetailsImages" : {
        "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Nina%20Carducci/ninacarducci1.png",
        "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/Nina%20Carducci/ninacarducci2.png"
     },
     "introduction" : "J'ai optimisé le référencement d'un site de photographe en travaillant sur plusieurs aspects clés : la vitesse de chargement, la structure du code, et l'accessibilité.Ma première tâche a été d'identifier les problèmes liés à ces aspects à l'aide d'outils comme Lighthouse et Wave.Ensuite, j'ai appliqué des améliorations ciblées pour accélérer le temps de chargement du site, améliorer la structure du code, et rendre le site plus accessible, ce qui contribue directement à un meilleur référencement.Enfin, j'ai réalisé un rapport détaillant les résultats obtenus avant et après les modifications, avec des captures d'écran des audits et des explications sur les améliorations apportées.",
     "documents" : "/Rapport d'optimisation Nina Carducci.pdf",
     "documentDescription" : "Rapport d'optimisation"
   },
   {
     "id": "8",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/724events.webp",
     "alt": "Image vitrine du projet 724 events",
     "title": "724 Events",
     "description": "Vous êtes développeur front-end freelance et l'agence événementielle 724events vous contacte pour finaliser son site vitrine one-page. Le site est fonctionnel mais présente quelques bugs qui doivent être corrigés. Jean-Baptiste, le directeur Marketing, vous envoie le code du site ainsi qu'un cahier de recette à compléter pour s'assurer que tous les problèmes sont résolus. Vous devez rapidement déboguer et tester le site afin de le rendre pleinement opérationnel.",
     "link": "https://github.com/klombar/Projet-724events",
     "difficultyRating": "4/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/724%20Events/724events1.webp",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/724%20Events/724events2.webp",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/724%20Events/724events3.webp"
     },
     "introduction" : "Dans ce projet, j'ai travaillé sur le débogage et la finalisation du développement d'un site one-page pour une agence d'événementiel.Tout d'abord, j'ai examiné le code existant et utilisé les Chrome DevTools pour identifier et comprendre les problèmes et bugs signalés sur le site. Une fois les problèmes identifiés, j'ai pu résoudre les bugs en utilisant mes connaissances en JavaScript. J'ai également tiré parti d'outils comme React Developer Tools, qui m'ont permis de mieux comprendre les erreurs et de les corriger efficacement.En plus du débogage, j'ai rédigé un cahier de recette, un document détaillant les scénarios de tests nécessaires pour m'assurer que le site fonctionnait correctement. Cela incluait des tests unitaires et fonctionnels pour vérifier chaque partie du site.J'ai également utilisé Yarn comme gestionnaire de packages et Node.js pour exécuter le code JavaScript côté serveur. Ces outils ont facilité la gestion des dépendances et l'exécution des tests localement.Pour le versioning et la gestion du code, j'ai utilisé GitHub, et pour le développement, j'ai travaillé avec Visual Studio Code. Ces outils m'ont permis de structurer mon travail et de collaborer efficacement tout au long du projet.",
     "documents" : "/cahier de recette site 724 Events.pdf",
     "documentDescription" : "cahier de recette"
   },
   {
     "id": "9",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/Argentbank.webp",
     "alt": "Image vitrine du projet argentbank",
     "title": "ArgentBank",
     "description": "Vous avez rejoint Argent Bank en tant que développeur front-end pour la création d'un tableau de bord utilisateurs. Vous travaillez avec Mila sur l'authentification des utilisateurs : création d'une application React responsive pour la gestion des connexions, la consultation des profils et l'utilisation de Redux pour l'état. Vous suivez les bonnes pratiques de Green Code en optimisant les images et en créant des composants réutilisables.",
     "link": "https://github.com/klombar/Projet-Argentbank",
     "difficultyRating": "5/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/ArgentBank/argentbank1.webp",
      "img2" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/ArgentBank/argentbank2.webp",
      "img3" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/main/src/assets/Images/Details%20projet%20images/ArgentBank/argentbank3.webp"
     },
     "introduction" : "Dans ce projet, j'ai travaillé sur le développement front-end d’une application bancaire, en utilisant React et Redux pour créer une interface dynamique et réactive.Ma mission principale a été d'intégrer le front-end avec le back-end en réalisant des appels API REST. Cela a permis de connecter les deux parties de l'application et d'assurer une communication fluide entre le client et le serveur.J'ai utilisé React pour développer l'interface utilisateur, en me concentrant particulièrement sur la création d'un tableau de bord complet et responsive, offrant ainsi une expérience optimale aux utilisateurs.Pour gérer l'état de l'application de manière efficace, j'ai utilisé Redux. Cette bibliothèque m'a permis de maintenir un état global cohérent à travers l’application.Pour définir les points d’accès de l’API et gérer les interactions avec les données des transactions, j'ai utilisé Swagger. Cet outil m'a permis de décrire de manière claire et précise les routes et les actions nécessaires pour l'API.Enfin, j'ai utilisé Node.js pour exécuter le code JavaScript côté serveur, ce qui m’a offert une expérience pratique dans la gestion d'une application full-stack."
   },
   {
     "id": "10",
     "image": "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/qwenta.webp",
     "alt": "Image vitrine du projet qwenta",
     "title": "Qwenta",
     "description": "Vous êtes développeur front-end chez Webgencia et devez préparer le projet \"Menu Maker\" pour Qwenta. En l'absence du Product Owner, Soufiane, vous rédigez un document de spécifications techniques et créez un tableau Kanban pour suivre les tâches. Vous organisez également une veille sur des technologies clés. Enfin, vous préparez une présentation pour Soufiane avant sa réunion avec le client.",
     "link": "https://github.com/klombar/Projet-Qwenta-MenuMaker",
     "difficultyRating": "3/5",
     "projectDetailsImages" : {
      "img1" : "https://raw.githubusercontent.com/klombar/Portfolio-Lombardo-Kevin/refs/heads/main/src/assets/Images/Image%20vitrine%20projet%20carrousel/qwenta.webp"
     },
     "introduction" : "Dans ce projet, j'ai été impliqué dans la planification du développement d'un site web, sans intervenir directement dans le codage.Ma mission consistait à organiser le développement en analysant les maquettes, les spécifications fonctionnelles et les User Stories du site. J'ai également entrepris une veille technologique pour rester informé des dernières tendances et technologies pertinentes pour le projet.J'ai rédigé les spécifications techniques, en identifiant les besoins fonctionnels et en décomposant les fonctionnalités en tâches spécifiques. Cette phase de planification était essentielle pour garantir que le développement se déroule de manière structurée.Pour gérer le projet, j'ai utilisé un outil de gestion de projet, comme Notion, pour organiser les tâches et créer un tableau Kanban. Cela m'a permis de suivre efficacement l'avancement du projet et de m'assurer que toutes les étapes étaient bien couvertes.Enfin, j'ai présenté la solution technique, en expliquant les choix faits et la manière dont les besoins fonctionnels ont été traduits en spécifications techniques.",
     "documents" : "/Webgencia - Qwenta MenuMaker - Présentation.pdf",
     "documentDescription" : "Présentation"
   }
 ]